tap 'caskroom/cask'

brew 'git'
brew 'npm'
brew 'python3'
brew 'heroku'
brew 'coreutils'
brew 'screen'
brew 'yarn'
brew 'watchman'
brew 'rbenv'
brew 'bash'
brew 'pandoc'
brew 'tldr'
brew 'aria2'
brew 'findutils'
brew 'pipenv'
brew 'youtube-dl'
brew 'bat'        # cat alternative
brew 'fzf'        # ctrl+r alternative
brew 'htop'       # top alternative
brew 'fd'         # find alternative
brew 'weechat'    # irc
brew 'peco'       # filtering
#brew 'tmux'
brew 'mutt'
brew 'zsh'        # shell
brew 'fish'       # shell
brew 'cmus'       # music player
brew 'tig'        # git client
brew 'pianobar'
brew 'googler'    # CLI google
brew 'sox'

# Utilities
cask 'flux'
cask 'spectacle'
cask 'vlc'
cask 'dropbox'
#cask 'rider'
cask 'calibre'
#cask 'docker'
cask 'visual-studio-code'
cask 'skype'
cask 'imageoptim'
cask 'sourcetree'
cask 'firefox'
#cask 'mactex'      # very finnicky install
cask 'macvim'
cask 'evernote'
cask 'postman'
cask 'spotify'
cask 'disk-inventory-x'
#cask 'krita'
#cask 'steam'
#cask 'visual-studio'     # not friendly with updates
cask 'iterm2'
#cask 'boostnote'
#cask 'mtmr'               # my touchbar my rules

# Games
#cask 'openmw' # outdated cask
cask 'openemu'
cask 'openttd'

mas 'Todoist', id: 585829637

